[
  {
    "id": "book1",
    "title": "Deep Learning",
    "description": "The definitive textbook on deep learning, covering both theoretical foundations and practical applications.",
    "longDescription": "Written by three experts in the field, Deep Learning is the only comprehensive book on the subject. It provides much-needed broad perspective and mathematical preliminaries for beginners, explains cutting-edge research, and presents best practices with advice on the practical aspects of implementing deep learning techniques.",
    "url": "https://www.deeplearningbook.org/",
    "thumbnail": "https://m.media-amazon.com/images/I/A10G+oKN3LL.jpg",
    "authors": ["Ian Goodfellow", "Yoshua Bengio", "Aaron Courville"],
    "publisher": "MIT Press",
    "year": "2016",
    "pages": 800,
    "tags": ["ML", "NLP", "Vision", "Math"],
    "difficulty": "Advanced",
    "dateAdded": "2025-03-09"
  },
  {
    "id": "book2",
    "title": "Understanding Deep Learning",
    "description": "An authoritative and accessible introduction to deep learning, balancing theory and practice.",
    "longDescription": "This book provides a comprehensive overview of deep learning, covering key topics and recent advances such as transformers and diffusion models. It presents concepts in an intuitive form, with minimal mathematical prerequisites, extensive illustrations, and practice problems. The book is suitable for anyone with a basic background in applied mathematics.",
    "url": "https://mitpress.mit.edu/9780262048644/understanding-deep-learning/",
    "thumbnail": "https://udlbook.github.io/udlbook/assets/book_cover-B3FyEkB6.jpg",
    "authors": ["Simon J.D. Prince"],
    "publisher": "MIT Press",
    "year": "2023",
    "pages": 544,
    "tags": ["Deep Learning", "AI", "Machine Learning", "Math"],
    "difficulty": "Intermediate",
    "dateAdded": "2023-12-05"
  },  
  {
    "id": "book2",
    "title": "Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow",
    "description": "A practical guide to machine learning with Python and its libraries.",
    "longDescription": "Through a series of recent breakthroughs, deep learning has boosted the entire field of machine learning. Now, even programmers who know close to nothing about this technology can use simple, efficient tools to implement programs capable of learning from data. This book might get less attention perhaps due to using TensorFlow but it is one of the best practical books on machine learning in general.",
    "url": "https://www.oreilly.com/library/view/hands-on-machine-learning/9781492032632/",
    "thumbnail": "https://m.media-amazon.com/images/I/81R5BmGtv-L._AC_UF1000,1000_QL80_.jpg",
    "authors": ["Aurélien Géron"],
    "publisher": "O'Reilly Media",
    "year": "2019",
    "pages": 856,
    "tags": ["ML", "Vision", "NLP"],
    "difficulty": "Intermediate",
    "dateAdded": "2025-03-08"
  },
  {
    "id": "book3",
    "title": "Build a Large Language Model from Scratch",
    "description": "This book guides readers through creating their own large language model (LLM) from the ground up, covering each stage with clear explanations and code examples.",
    "longDescription": "The book provides a step-by-step approach to understanding how LLMs work by coding them from scratch. It covers topics such as data preparation, architecture design, pretraining, and finetuning. The method mirrors the approach used in creating large-scale foundational models like those behind ChatGPT. The book includes code for loading and finetuning larger pretrained models, making it suitable for both educational purposes and practical applications.",
    "url": "https://amzn.to/4fqvn0D",
    "thumbnail": "https://images.manning.com/book/1/92362be-2647-4fa1-9998-e4959d9c568f/DOTD_Raschka.png",
    "authors": ["Sebastian Raschka"],
    "publisher": "Manning Publications",
    "year": "2023",
    "pages": null,
    "tags": ["LLMs", "Deep Learning", "NLP", "AI"],
    "difficulty": "Intermediate",
    "dateAdded": "2025-03-09",
    "githubRepo": "https://github.com/rasbt/LLMs-from-scratch"
  },
  {
    "id": "book4",
    "title": "Machine Learning with PyTorch and Scikit-Learn",
    "description": "This book provides a comprehensive introduction to machine learning, covering both traditional methods and deep learning techniques using PyTorch.",
    "longDescription": "The book starts with foundational concepts in machine learning using scikit-learn, including data preprocessing, classification algorithms, and model evaluation. It then transitions to deep learning with PyTorch, covering topics such as neural networks, convolutional neural networks (CNNs), recurrent neural networks (RNNs), transformers, and generative adversarial networks (GANs). The book includes practical code examples and is suitable for readers with basic Python knowledge.",
    "url": "https://anorshop.com/images/product_images/1/1843/650111.jpg",
    "thumbnail": "https://pbs.twimg.com/media/FXpMj9EUcAAovIt.jpg:large",
    "authors": ["Sebastian Raschka", "Yuxi (Hayden) Liu", "Vahid Mirjalili"],
    "publisher": "Packt Publishing",
    "year": "2022",
    "pages": 770,
    "tags": ["Machine Learning", "PyTorch", "Scikit-Learn", "Deep Learning"],
    "difficulty": "Intermediate",
    "dateAdded": "2022-02-25",
    "githubRepo": "https://github.com/rasbt/machine-learning-book"
  },
  {
    "id": "book5",
    "title": "The Little Book of Deep Learning",
    "description": "A concise introduction to deep learning, covering foundational concepts, model architectures, and practical applications.",
    "longDescription": "This book provides a comprehensive yet accessible overview of deep learning, focusing on key topics such as machine learning basics, efficient computation, neural network components, and various architectures like MLPs, CNNs, and transformers. It also explores applications in image processing, speech recognition, and text generation. Designed to be read on a phone screen, it is suitable for both beginners and experienced practitioners seeking a solid understanding of deep learning principles.",
    "url": "https://fleuret.org/public/lbdl.pdf",
    "thumbnail": "https://pbs.twimg.com/media/F_jXjnpXwAAn5fm?format=jpg&name=4096x4096",
    "authors": ["François Fleuret"],
    "publisher": "Self-published",
    "year": "2024",
    "pages": null,
    "tags": ["Deep Learning", "Neural Networks", "Machine Learning"],
    "difficulty": "Intermediate",
    "dateAdded": "2024-05-19",
    "githubRepo": "https://github.com/mustafaaljadery/little-book-of-dl"
  },
  {
    "id": "book6",
    "title": "Dive into Deep Learning",
    "description": "This interactive book provides a comprehensive introduction to deep learning, covering both theoretical foundations and practical implementations.",
    "longDescription": "The book starts from scratch, explaining deep learning concepts, context, and code. It covers topics such as neural networks, convolutional neural networks (CNNs), recurrent neural networks (RNNs), transformers, and optimization algorithms. The book is implemented with multiple frameworks like PyTorch, TensorFlow, and JAX, offering executable Jupyter notebooks for hands-on learning. It includes discussions on computer vision, natural language processing, and automatic speech recognition, making it suitable for beginners and experienced practitioners alike.",
    "url": "https://d2l.ai",
    "thumbnail": "https://m.media-amazon.com/images/I/61ze2IXco7L._AC_UF1000,1000_QL80_.jpg",
    "authors": ["Aston Zhang", "Zachary C. Lipton", "Mu Li", "Alexander J. Smola"],
    "publisher": "Cambridge University Press",
    "year": "2023",
    "pages": 574,
    "tags": ["Deep Learning", "Neural Networks", "Machine Learning"],
    "difficulty": "Intermediate",
    "dateAdded": "2023-07-12",
    "githubRepo": "https://github.com/d2l-ai/d2l-en"
  },
  {
    "id": "book7",
    "title": "Designing Machine Learning Systems",
    "description": "This book provides a holistic approach to designing machine learning systems, focusing on reliability, scalability, and maintainability.",
    "longDescription": "Chip Huyen's book addresses the complexities of ML systems by examining key components such as data processing, feature engineering, model selection, and deployment strategies. It emphasizes the importance of aligning ML systems with business objectives and offers practical advice on handling challenges like data distribution shifts and model monitoring. The book is enriched with real-world case studies and insights from industry practitioners.",
    "url": "https://www.oreilly.com/library/view/designing-machine-learning/9781098115777/",
    "thumbnail": "https://m.media-amazon.com/images/I/81aSHEzSB1L.jpg",
    "authors": ["Chip Huyen"],
    "publisher": "O'Reilly Media",
    "year": "2022",
    "pages": 432,
    "tags": ["Machine Learning", "MLOps", "System Design"],
    "difficulty": "Intermediate to Advanced",
    "dateAdded": "2022-06-01",
    "githubRepo": "https://github.com/chiphuyen/dmls-book"
  },
  {
    "id": "book8",
    "title": "Computer Vision: Algorithms and Applications",
    "description": "This book provides a comprehensive introduction to computer vision, covering both foundational algorithms and practical applications.",
    "longDescription": "Richard Szeliski's book covers a wide range of topics in computer vision, including image formation, feature detection, stereo vision, motion estimation, and object recognition. It emphasizes both theoretical foundations and practical applications, making it suitable for students and practitioners alike. The book includes discussions on recent advances in the field and provides a solid foundation for understanding computer vision techniques.",
    "url": "https://szeliski.org/Book/",
    "thumbnail": "https://m.media-amazon.com/images/I/51qgx0XJAQL._UF1000,1000_QL80_.jpg",
    "authors": ["Richard Szeliski"],
    "publisher": "Springer",
    "year": "2010",
    "pages": 812,
    "tags": ["Computer Vision", "Image Processing", "Machine Learning"],
    "difficulty": "Intermediate to Advanced",
    "dateAdded": "2010-08-01"
  }  
]
